Repository: mozilla-l10n/mt-training-data
Catalog: quc/quc_pontoon.tmx
Source language: en_us
Languages: quc

source: en-US, en
quc: quc,es-MX,es,en-US,en

source: Account no longer exists. Recreate it?
quc: Le kemb'i'aj man k'o ta chik. ¿Kawinaqirisaj?

source: Account notifications will now also be sent to %(secondaryEmailVerified)s.
quc: Ub'ixikil rech kemb'i'aj xuquje' ktaq na b'ik chech %(secondaryEmailVerified)s.

source: Account picture
quc: Wachib'al rech kemb'i'aj

source: Account verified
quc: Qat'utal kemb'i'aj

source: Change...
quc: Uk'exik...

source: Complete set-up by entering the new password on your other Firefox devices.
quc: Chatz'aqatisaj ujeqik ruk' uch'apik k'ak' retokib'al pa le jun chi wiqkemchakub'al rech Firefox.

source: Connected
quc: T'iqitalik

source: Display name
quc: Uk'utik B'i'aj

source: Email address
quc: Kemriqonib'al rech taqoqxa'nib'al

source: Firefox Sync will resume momentarily
quc: Firefox Sync kunitz'arisaj na chanim

source: Forgot password?
quc: ¿Xasach le aretokib'al?

source: New password
quc: K'ak' retokib'al

source: Old password
quc: Ojer retokib'al

source: Once you're finished, use your new password to sign in on all of your devices.
quc: Are taq chk'is awumal, chakojo' le k'ak' aretokib'al chech umajixik kemchak a ronojel taq awiqkemchakub'al.

source: Other
quc: Jun chik

source: Password
quc: Retokib'al

source: Password reset
quc: K'ak' uwokik retokib'al

source: Password reset successfully. Sign in to continue.
quc: Utz xub'an k'ak' uwokik retokib'al. Chamajij kemchak chech ub'anik na.

source: %(permissionName)s (required)
quc: %(ya'b'al b'e b'i'aj)taq (kajawatajik)

source: Please Select One
quc: Chacha' jun

source: Primary email verified
quc: Q'atutal uk'u'x taqoqxa'nib'al

source: Secondary email verified
quc: Q'atum ukab' taqoqxa'nib'al

source: Sign in
quc: Chamajij kemchak

source: Sign-in confirmed
quc: Suk'um ub'ixik umajixik kemchak

source: Thank you for reaching out to Mozilla Support about <b>%(escapedLowercaseTopic)s</b> for <b>%(escapedSelectedProduct)s</b>. We'll contact you via email as soon as possible.
quc: Tyox chi awech chech ach'awem ruk' Toq'ab'al rech Mozilla chi rij <b>%(escapedLowercaseTopic)s</b> chech <b>%(escapedSelectedProduct)s</b>. kqataq jun taqoqxa'nib'al awuk' aninaq aq'anoq.

source: Thank you for reaching out to Mozilla Support about <b>%(escapedLowercaseTopic)s</b>. We'll contact you via email as soon as possible.
quc: Tyox chi awech chech ach'awem ruk' Toq'ab'al rech Mozilla chi rij <b>%(escapedLowercaseTopic)s</b>. Kqataq jun taqoqxa'nib'al awuk' aninaq aq'anoq.

source: Unknown account. <a href="/signup">Sign up</a>
quc: Kemb'i'aj man eta'matal taj. <a href="/signup">Utz'ib'axik ib'</a>

source: Welcome back
quc: Utz atzalijik loq

source: You are now ready to make changes to your Firefox Account.
quc: La jamal awach chech ub'anik taq k'exonem chanim chech le akemb'i'aj rech Firefox.

source: You are now ready to use %(serviceName)s
quc: Utz chik kakoj %(serviceName)s

source: Your password has been reset
quc: Xk'ak'arisax uwokik le aretokib'al

source: 5 myths about password managers
quc: 5 ub'ixikil chi rij taq ilawachib'a retokib'al

source: About { -product-name }
quc: Chi rij { -product-name }

source: Account balances
quc: Rajilab'alil taq kemb'i'aj

source: Add a new email address
quc: Chaya' jun k'ak' kemriqonib'al rech taqoqxa'nib'al

source: Additional information, including:
quc: Utz'aqatil q'alajisanem rachi'l:

source: Address book contacts
quc: Taq ajch'ab'e'n rech le uwujil taq kemriqonib'al

source: Advanced search in sensitive breaches
quc: Cholpaqal taq tzukunem pa taq retztaqan rech nab'alil.

source: { $affectedEmail } appeared in this breach. <a>What to do next</a>
quc: { $affectedEmail } xk'utun pa we jun retztaqan. <a>Jas kb'anik </a>

source: After reviewing the details about a breach and taking steps to protect your personal info, you can mark breaches as resolved.
quc: Are taq chilitaj taq ucholajil chi rij le retztaqan chi'l ub'anik taq ucholajil chech uchajixik ¶ le awinaqilal q'alajisanem, utz kakoj retal taq retztaqan pacha' solom.

source: Age groups
quc: Taq wokaj rech Junab'

source: Ages
quc: Taq junab'

source: Alert me about new breaches
quc: Chana'b'aj chi wech chi rij k'ak' taq retztaqan

source: All { -brand-name } products honor our Personal Data Promise: Take less. Keep it safe. No secrets.
quc: Ronojel taq k'ayij rech { -brand-name } kkib'an le qatzujum chi rij winaqilal q'alajisanem: xa nitz' kab'ano, chaya' pa chajib'al, man k'o ta owatalik.

source: All breaches in { -product-name }
quc: Ronojel juq'attzij pa { -product-name }

source: All known breaches have been marked as resolved
quc: Ronojel taq retztaqan le man eta'matal taj kojom retal pacha' solom

source: Another one down. Nice work!
quc: ¡Xqaj chi jun. Utz chak!

source: Appears in { $breachCount } known breaches.
quc: Kk'utun pa { $breachCount } eta'matal taq retztaqan.

source: Apps installed on devices
quc: Taq wiqkemchakub'al jeqetal pa taq kojkemchak

source: Astrological signs
quc: Taq etal rech nik'onem wachkaj

source: A strong password uses a combination of upper and lowercase letters, special characters, and numbers. It doesn’t contain personal info like your address, birthday, or family names.
quc: Jun kowilal retokib'al kukoj jun xolanem rech nim tz'ib' chi'l nitz' tz'ib', nim ucholajil taq tz'ib', ¶ chi'l taq ajilab'al. Man ruk'a'am ta winaqilal q'alaljisanem pacha' ¶ le akemriqonib'al, ralaxb'al, chi'l kib'i' taq ajupaja.

source: Audio recordings
quc: Taq k'olch'ab'alil

source: Auth tokens
quc: Taq token rech q'alajwinaqilal

source: Avatars
quc: Taq avatar

source: Avoid using personal info in passwords
quc: Makoj winaqilal q'alajisanem pa taq retokib'al

source: A website data breach happens when cyber criminals steal, copy, or expose personal information from online accounts. It’s usually a result of hackers finding a weak spot in the website’s security. Breaches can also happen when account information gets leaked by accident.
quc: Kxajtaj jun retztaqan rech juq'attzij rech uk'olib'al web' are taq le ekemelaq'omab' ke'elaq'anik, on kkelesaj uwach on kkiya' winaqilal q'alajisanem pa taq kemb'i'aj rech nimk'atz, Are wa' jun uwachinem kech taq e b'ank'ax are taq kkiriq jun uk'olib'al web' le man k'o ta uchuq'ab'. Le taq retztaqan xuquje' kxajtajik are taq kq'alajisax le q'alajisanem le man chub'anik taj.

source: Back to Top
quc: Tzalijem pa uwi'

source: Bank account numbers
quc: Rajilab'alil taq kemb'i'aj rech ja k'olpwaq

source: Beauty ratings
quc: Rajilab'alil taq je'lal

source: Biometric data
quc: Juq'attzij rech q'alwinaqilal

source: Bios
quc: K'aslem

source: { -brand-fpn } throws off the websites and data collectors that profile you with ads by masking your real IP address.
quc: { -brand-fpn } Kuchup taq uk'olib'al web' chi'l taq mulib'al juq'attzij le katuk'utu ruk' taq kemtzijob'elil le kuch'uq le qas akemriqonib'al IP.

source: { -brand-fxa } Email - Primary
quc: { -brand-fxa } Taqoqxa'nib'al - Nab'e

source: { -brand-name } apps and services
quc: { -brand-name } Taq kojkemchak chi'l taq patanib'al

source: { -brand-name } Browser for Desktop
quc: { -brand-name } Nik'onel rech ilwach

source: { -brand-name } Browser for Mobile
quc: { -brand-name } Nik'onel rech Achib'il ch'aweb'al

source: { -brand-name } browser not required for a { -brand-fxa }. You may receive info about { -brand-Mozilla } services.
quc: { -brand-name } man rajawaxik ta le nik'onel chech jun { -brand-fxa }. Wene' kak'ulaj q'alajisanem chi rij { -brand-Mozilla } taq pataninem.

source: { -brand-name } is tech that fights for your online privacy.
quc: { -brand-name } are k'ak' eta'mab'al le kukoj uchuq'ab' chech le echeb'alil rech nimk'atz.

source: Breach added:
quc: Retztaqan ya'talik:

source: Breach Alert Notifications
quc: Ub'ixikil rech na'b'anem rech retztaqan

source: { $breachCount } NEW BREACH FOUND
quc: { $breachCount } K'AK' RETZTAQAN RIQITAJINAQ

source: Breach data provided by { $hibp-link }
quc: Taq juq'attzij rech retztaqan ya'om rumal { $hibp-link }

source: Breach date:
quc: Uq'ijol retztaqan:

source: Breaches
quc: Taq retztaqan

source: Breach Summary
quc: Nitz'arisanem rech retztaqan

source: Bring { -brand-name } to your phone and tablet
quc: Chak'ama' { -brand-name } pa le ach'aweb'al chi'l pa le t'in kemahib'il

source: Browser user agent details
quc: Taq ucholajil kojonel rech nik'onel

source: Browsing histories
quc: Taq b'anatal kanoq rech tzukunem

source: Buying preferences
quc: Taq ajawatajem rech loq'omanem

source: Career levels
quc: Taq ucholajil eqele'n

source: Car ownership statuses
quc: Taq kemub'antajik echeb'alil rech ch'ich'

source: Cellular network names
quc: Ub'i' taq achib'il kemk'at

source: Change password for this site
quc: Chak'exa' le aretok'ib'al rech we uk'olib'al web'

source: Change Primary Email Address
quc: Chak'exa' nab'e kemriqonib'al rech taqoqxa'nib'al.

source: Changes saved!
quc: Xk'olotaj taq k'exonem

source: Change your password
quc: Chak'exa' le aretokib'al

source: Change your password to a strong, unique password.
quc: Chak'exa' le ataqoqxa'nib'al pa jun kowilal utukelal retokib'al.

source: Charitable donations
quc: Uk'u'xal sipanem

source: Chat logs
quc: Taq cholajinem rech tz'ib'tzijonem

source: Check for Breaches
quc: Chaq'atuj taq retztaqan

source: Close menu
quc: Chatz'apij cholokib'al

source: Compromised accounts:
quc: Taq kemb'i'aj k'o retztaqan chi rij:

source: Compromised data:
quc: Taq juq'attzij k'o retztaqan chi rij:

source: Conduct a basic search
quc: Ub'anik jun tzukunem qas kk'ojik

source: Could not add email address to database.
quc: Man xkowinb'ex ta uya'ik le kemriqonib'al pa mulib'al juq'attzij

source: Could not load breaches.
quc: Man xkowinb'ex ta uya'ik uchuq'ab' taq retztaqan.

source: Create a { -brand-fxa } for your full report of breaches and to get alerts.
quc: Chawinaqirisaj jun { -brand-fxa } chech le tz'aqat wokb'ixikil rech taq retztaqan chi'l uriqik taq na'b'anem.

source: Create a { -brand-fxa } to monitor your email for ongoing breaches. Once you’ve verified your email, you’ll also receive a full report of past breaches, including sensitive breaches.
quc: Chawinaqirisaj jun { -brand-fxa } chech rilawachixik le ataqoqxa'nib'al chech utzukuxik taq retztaqan. ¶ Are taq kq'atutaj le ataqoqxa'nib'al, xuquje' kak'ulaj jun tz'aqat woktzijob'al rech taq retztaqan kanoq, ¶ rachi'l taq retztaqan rech na'b'alil.

source: Create unique passwords and save them somewhere safe, like a password manager.
quc: Chawinaqirisaj jalan taq retokib'al ch'l chak'olo' apawije' chajib'al, pacha' ilawachib'al retokib'al.

source: Credit card CVV
quc: Uwujil qajanik rech CVV

source: Credit cards
quc: Taq uwujil qajanik

source: Credit status information
quc: Q'alajisanem rech kemub'antajik qajanik

source: Cryptocurrency wallet hashes
quc: Hash rech alaj k'olib'al rech t'inpwaq

source: Customer feedback
quc: Utzijoxik rech loq'o'manel

source: Customer interactions
quc: Taq kemb'anowem rech loq'o'manel

source: Cyber criminals could find your password on the dark web and use it to log in to your other accounts. The best way to protect your accounts is to use unique passwords for each one.
quc: Le e kemelaq'omab' wene kkiriq le aretokib'al pa le uq'eqal web' chech ukojik ¶ chech okem a nik'aj chi taq kemb'i'aj ¶ are ukoik utukelal taq retokib'al chi jujunal.

source: Data Aggregator Breach
quc: Retztaqan rech ya'l taq juq'attzij.

source: Data Aggregator Breaches
quc: Taq retztaqan rech ya'l taq juq'attzij

source: Data aggregators, or data brokers, collect information from public records and buy it from other companies. They compile this data to sell it to companies for marketing purposes. Victims of these breaches are less likely to experience financial fraud, but hackers could use this data to impersonate or profile them.
quc: Le taq ya'l juq'attzij o taq mulinel taq juq'attzij, kkimuluj q'alajisanem kech uk'iyal ¶ taq cholajib'al chi'l kkiloq chi kech e nik'aj chi k'aywokaj, kkimulij we taq juq'attzij k'ate k'u ri' kkik'ayij chi kech e nik'aj chi k'aywokaj ¶ chech ub'anik taq k'ayinem. Le taq e riqol uk'axal rech taq we retztaqan man qas ta e k'o pa uk'eyowal chech uriqik uk'axal rech pwaqilal.¶ sub'unem, xa k'ut le taq b'ank'ax wene kkikoj we juq'attzij chech kijalwachixik.

source: Data breaches are on the rise. If your personal info appears in a new data breach, { -product-name } sends you an alert — so you can take action and protect your accounts.
quc: Le taq retztaqan rech taq juq'attzij ktajin ke'enimarik. We kq'alajin le awinaqilal q'alajisanem pa jun k'ak' retztaqan rech taq juq'attzij, ¶ { -product-name } kutaq jun na'tajisab'al chi awech — are chi utz kachajij le akemb'i'aj.

source: Dates of birth
quc: Taq uq'ijol ralaxb'al

source: Deceased date
quc: Uq'ijol kamikal

source: Deceased statuses
quc: Taq kemub'antajik kamikal

source: Device information
quc: Q'alajisanem rech wiqkemchakub'al

source: Device usage tracking data
quc: Taq juq'attzij rech uterne'xik ukojik wiqkemchakub'al

source: Download { -brand-name }
quc: Chaqasaj { -brand-name }

source: Drinking habits
quc: Naq'atal ub'anik uqumuxik

source: Drug habits
quc: Naq'atal ub'anik kunab'al

source: Eating habits
quc: Taq naq'atal ub'anik wa'im

source: Education levels
quc: Taq ucholajil eta'mab'al

source: Email address being monitored
quc: kemriqonib'al rech taq taqoqxa'nib'al ktajin kq'atuxik

source: Email addresses
quc: Taq kemriqonib'al rech taqoqxa'nib'al

source: Email Addresses
quc: Kemriqonib'al rech taqoqxa'nib'al

source: Email me if one of my email addresses below appears in a data breach.
quc: Chataqa' jun nutaqoqxa'nib'al chi wech we k'o jun chi kech taq nukemriqonib'al rech taqoqxa'nib'al chi uxe' kk'utun pa jun retztaqan rech juq'attzij.

source: Email messages
quc: Taq oqxa'n rech taqoqxa'nib'al

source: Email Sent!
quc: Taqoqxa'nib'al xtaqik

source: Email Successfully Verified!
quc: Taqoqxa'nib'al utz uq'atuxik b'anom!

source: Email Verification Required
quc: Kajawataj q'atunem pa taqoqxa'nib'al

source: Employers
quc: E ya'l chak

source: Employment statuses
quc: Kemub'antajik chak

source: Encrypted keys
quc: Wiqotal taq pitz'b'al

source: Enroll multiple emails in breach monitoring
quc: Chatz'ib'aj k'i taqoqxa'nib'al pa le rilawachixik retztaqan

source: Enter Email Address
quc: Chach'apa' kemriqonib'al rech taqoqxa'nib'al

source: Error
quc: k'axk'olil

source: Error connecting to { -brand-HIBP }.
quc: K'axk'olil rech t'iq'onem pa { -brand-HIBP }.

source: Ethnicities
quc: Taq komon

source: Even for old accounts, it’s important to update your password.
quc: Pine' ajer taq kemb'i'aj, rajawaxik kak'ak'arisaj aretokib'al.

source: Family members’ names
quc: Kib'i' uwinaqilal ajupaja

source: Family plans
quc: Taq cholb'anowem

source: Family structure
quc: ub'antajik ajupaja

source: Fast, private, and safe browsing everywhere you go. Find { -brand-name } in the Google Play and App Store.
quc: Aninaq, echeb'alil, chi'l chajital nik'onel apawije' katb'e wi. Chariqa' { -brand-name } pa le Google Play chi'l pa App Store.

source: Filter by Category:
quc: Chacha' chi cholajib'al:

source: Financial investments
quc: Ub'e'al pwaqilal

source: Financial transactions
quc: Taq q'axpwaq rech pwaqilal

source: Find Out
quc: Chariqa'

source: Find out about new data breaches
quc: Chariq'a' nik'aj chik chi rij taq retztaqan rech juq'attzij

source: Find out how to mitigate the risks of identity theft to prevent financial loss.
quc: Chaweta'maj jas kb'an chech uq'atexik relaq'axik winaqilal chech uq'atexik relaq'axik me'rkortil.

source: Find out if your data was exposed in this breach.
quc: Chawila' we xk'oji' le ajuq'attzij pa uk'axk'olil pa we retztaqan.

source: Find out if you’ve been part of a data breach
quc: Chawila' we k'o retztaqan b'anom chech ajuq'attzij

source: Find out if you’ve been part of a data breach with { -product-name }. Sign up for alerts about future breaches and get tips to keep your accounts safe.
quc: Chawila' we k'o taq retztaqan b'anom chi awech rech taq juq'attzij ruk' { -product-name }. Chatz'ib'aj awib' chech uk'ulaxik chi rij taq retztaqan aq'anoq chi'l chariqa' taq no'jib'al chech uchajixik taq akemb'i'aj.

source: Find out what hackers already know about you. Learn how to stay a step ahead of them.
quc: Chariqa' jachike e b'ank'ax keta'am chi awach, Chaweta'maj jas kab'ano are chi katnab'ej jun ucholajil chi kiwach.

source: Find out what you need to do to keep your data safe from cyber criminals.
quc: Che'ariqa' jas kab'ano chech uchajixik taq juq'attzij chech uq'atexik taq kemelaq'omab'.

source: Firefox account
quc: Kemb'i'aj rech Firefox

source: Fitness levels
quc: Taq ucholajil utzb'antajik

source: Frequently Asked Questions
quc: Amaq'el chab'ana' k'otb'al chi'aj

source: Genders
quc: Taq b'anatajilal

source: Get { -brand-fpn }
quc: Chariqa' { -brand-fpn }

source: Get { -brand-lockwise }
quc: Chariqa' { -brand-lockwise }

source: Get { -brand-name } on Android and iOS
quc: Chariqa' { -brand-name } chi'l Android chi'l iOS

source: Get help creating better passwords and keeping them safe.
quc: Chariqa' tob'anem chech uwinaqirisaxik utzalaj taq retokib'al chi'l kichajixik.

source: Get help remembering all your passwords and keeping them safe.
quc: Chariqa' tob'anik ruk' unatajisaxik ronojel taq aretokib'al chi'l che'achajij.

source: Get notifications in your browser
quc: Chak'ulaj taq ub'ixikil pa le nik'onel

source: Get notified the next time your personal info gets exposed in a known breach.
quc: Chariqa' ub'ixikil pa le jumul chik kk'oji' le awinaqilal q'alajisanem pa jun eta'matal retztaqan

source: Get ongoing alerts with a { -brand-fxa }.
quc: Amaq'el chak'ulaj taq na'b'anem ruk' jun { -brand-fxa }.

source: Get ongoing breach monitoring for multiple email addresses.
quc: Chariqa' junelik rilawachixik taq retztaqan chech uk'iyal taq kemriqonib'al rech taqoqxa'nib'al

source: Go to Dashboard
quc: Utz katb'e pa k'olwokaj rech rilawachixik

source: Hackers may try to use that same password and your email to get in to other accounts. Create a different and unique password for every account, especially for your bank account, email, and other websites where you save personal information.
quc: Le e b'ank'ax wene kkikoj le junam retokib'al chi'l le ataqoqxa'nib'al chech okem pa nik'aj chi kemb'i'aj. ¶ Chawinaqirisaj jun jalan chi'l utukelal retokib'al chech jujun taq kemb'i'aj, qas na chech le akemb'i'aj rech ja k'olpwaq, ¶ Taqoqxa'nib'al, chi'l nik'aj chi uk'olib'al web' jawi' kk'ol wi winaqilal q'alajisanem.

source: Have an account?
quc: ¿La k'o akemb'i'aj?

source: Have your online accounts been exposed in a data breach?
quc: ¡Wene e ya'om taq akemb'i'aj pa nimk'atz pa jun retztaqan rech juq'attzij?

source: Hide Resolved
quc: Owatal solom

source: Home
quc: Majib'al

source: How does { -product-name } treat sensitive sites?
quc: Jas kub'an { -product-name } chech taq wokk'olib'al rech na'b'alil

source: How do I know this is a legitimate email from { -product-name }?
quc: ¿Jas kinb'an chech reta'maxik we tzij rech { -product-name } we taqoqxa'nib'al?

source: However, it did appear in { $breachCount } other breaches.
quc: Xa k'ut man xq'alajin ta pa { $breachCount } jun chi retztaqan.

source: However, it did appear in { $breachCount } other known breaches.
quc: Xa k'ut, xk'utun pa { $breachCount } nik'aj chi eta'matal taq retztaqan.

source: How { -product-name } works
quc: Jas kchakun { -product-name }

source: How to create strong passwords
quc: Jas uwinaqirisaxik kowilal taq retokib'al

source: How to unsubscribe from { -product-name } alerts
quc: Jas uchupik utz'ib'axik ib' pa taq na'b'anem { -product-name }

source: I don’t recognize this company or website. Why am I in this breach?
quc: Man weta'am ta uwach we k'aywokaj on uk'olib'al web'. Jasche ink'o pa we jun retztaqan?

source: If you can’t log in, contact the website to ask how to update it. See an account you don’t recognize? Your data could have been sold or redistributed. This could also be an account you forgot you created or a company that changed names.
quc: We man ktkowin taj kamajij kemchak, chach'ab'ej le uk'olib'al web' kata chech jas kab'an chech uk'ak'arisaxik. ¶ ¿kawil jun kemb'i'aj le man aweta'am ta uwach? Wene xa xe'ek'ayix b'i le taq ajuq'attzij ¶ on jachatal chi jumul. Wa' xuquje' wene jun kemb'i'aj le xasacho ¶ xawinaqirisaj on wene xa xuk'ex ub'i' jun k'aywokaj.

source: If your information surfaces in a new data breach, we’ll send you an alert.
quc: We kq'alajin le aq'alajisanem pa jun k'ak' retztaqan, kqataq b'i na'b'anem chi awech.

source: If you use { -brand-name }, you’ll receive a notification if you visit a site that’s been breached. Find out right away if you were part of that breach and what you can do about it.
quc: We kakoj{ -brand-name }, kariq na jun ub'ixikil we kasolij jun ¶ jun wokk'olib'al web' le b'anom retztaqan chech. chawila' we chi'l at b'anom we retztaqan chi awech... chi'l jas rajawaxik kab'an chech.

source: Invalid Email
quc: Taqoqxa'n man utz taj

source: Invalid session
quc: Kemchak man utz taj

source: Is your new password unique, strong, and hard to guess? <a>Find out</a>
quc: Le ak'ak' retokib'al la jalanik, k'o uchuq'ab' chi'l la k'ax uch'akik? <a> Chariqa'</a>

source: It can sometimes take months or years for credentials exposed in a data breach to appear on the dark web. Breaches get added to our database as soon as they have been discovered and verified.
quc: K'or kuk'am jampa' ik' on jampa junab' are chi kk'utuk uk'axk'olil rech q'alajisab'al ¶ pa jun retztaqan rech uq'eqal web'. Le taq retztaqan aninaqil ke'eya' pa le mulib'al juq'attzij ¶ are taq ke'eriqitajik chi'l ke'eq'atutajik.

source: It’s easy to find birthdays, addresses, and family member names online. Keep these words out of your passwords.
quc: Man k'ax ta uriqik taq ralaxb'al, taq kemriqonib'al chi'l taq kib'i' ajupaja pa nimk'atz, makoj wa' taq tzij pa taq aretokib'al.

source: Keep track of your logins across all devices. Access them securely from your computer, phone, or tablet.
quc: Chacholajij taq umajixik kemchak pa ronojel taq awiqkemchakub'al. Chatokoq pa chajital okem pa le akematz'ib', ch'aweb'al on alaj t'inkemachib'il.

source: Keep up the momentum. Check your dashboard to see if there’s more to do.
quc: Chak'olo' le na'tab'al. chawila' le ak'olwokaj rech rilawachixik chech rilik we k'o na nik'aj chik kb'anik.

source: Known data breaches have exposed your info
quc: Le taq retztaqan rech juq'attzij le eta'matalik uya'om le aq'alajisanem pa uk'axk'olil

source: Known data breaches marked as resolved
quc: eta'matal retztaqan rech taq juq'attzij kojom retal pacha' solom

source: LATEST BREACH ADDED
quc: UK'ISB'AL RETZTAQAN YA'TALIK

source: Learn how to avoid bad password habits that make a hacker’s work easy.
quc: Chaweta'maj uq'atexik taq retokib'al le man k'o ta uchuq'ab' le kub'ano' chi man k'ax ta uriqik chi kech le e b'ank'ax.

source: Learn more.
quc: Chaweta'maj nik'aj chik.

source: Lock down your accounts to keep your information out of the wrong hands.
quc: Chaq'atej taq akemb'i'aj chech uchajixik le aq'alajisanem.

source: Made by { -brand-Mozilla }
quc: B'anom rumal { -brand-Mozilla }

source: Make the new password different and unique
quc: Chab'ana' chech le aretokib'al chi jalan ub'antajik chi'l utukelal

source: Make your passwords strong, secure, and hard to guess.
quc: Chab'ana' kowilal chech le aretokib'al, chajitalik, chi'l k'ax uriqik.

source: Manage all email addresses in { $preferencesLink }.
quc: Chawilawachij ronojel taq kemriqonib'al rech taqoqxa'nib'al pa { $preferencesLink }.

source: Manage { -brand-fxa }
quc: Rilawachixik{ -brand-fxa }

source: Manage Email Addresses
quc: Chawilawachij kemriqonib'al rech taqoqxa'nib'al

source: Mark as Resolved
quc: Chakojo' retal pacha' solom
